Table of Contents
 Enum TypeSLSLimitStressCheck
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
Type of SLS check in extreme result
public enum TypeSLSLimitStressCheck
Fields
Check_5_10_2_1_1_Tendons = 11
check 5.10.2.1 (1) stress in tendons is used
Check_5_10_3_2_Tendons = 10
check 5.10.3 (2) stress in tendons is used
Check_7_2_2_Concrete_fck = 6
check 7.2 (2) is used
Check_7_2_3_Concrete_fck = 7
check 7.2 (3) is used
Check_7_2_5_ReinforcementBars_fyk = 9
check 7.2 (5) stress in tendons is used
Check_7_2_5_Tendons_fpk = 8
check 7.2 (5) stress in reinforcement bars is used
notSet = -1
not set value
Fields
 Name |  Description
 Check_5_10_2_1_1_Tendons = 11
check 5.10.2.1 (1) stress in tendons is used
 Check_5_10_3_2_Tendons = 10
check 5.10.3 (2) stress in tendons is used
 Check_7_2_2_Concrete_fck = 6
check 7.2 (2) is used
 Check_7_2_3_Concrete_fck = 7
check 7.2 (3) is used
 Check_7_2_5_ReinforcementBars_fyk = 9
check 7.2 (5) stress in tendons is used
 Check_7_2_5_Tendons_fpk = 8
check 7.2 (5) stress in reinforcement bars is used
 notSet = -1
not set value
 Edit this page